// 1) რა განსხვავებაა input-ის value და placeholder-ს შორის?
// მსგავსება რა ააქვთ ისაა კითხვა დ;, ინპუთის value არის თვითონ მომხარებელი შიგნით რასაც ჩაწერს, და placeholder მიმანიშნებელი ტექსტი რა უნდა ჩაწეროს, ორივე ატრიბუტად  შეგვიძლია გამოვიყენოთ
// 2) რას აკეთებს onChange ფუნქცია?
// ინპუტში რასაც ჩავწერთ თუნდაც ერთ ასოს რამე რომ მოხდეს  ივენთი
// 3) როგორ შეგვიძლია ვაკონტროლოთ input-ის მნიშვნელობა React-ში?
// onChange ზე შევცვალოთ state,  ან onSubmit ზე name ით წამოვიღოთ და მერე შევცვალოთ state


