// 2) რა არის HTTP:
// HTTP (HyperText Transfer Protocol) არის პროტოკოლი, რომლის საშუალებითაც ბრაუზერი და სერვერი ერთმანეთს ინფორმაციას გადასცემენ. გამოიყენება ვებსაიტებთან დასაკავშირებლად.

// 3) რა არის HTTP Request და Request Methods:
// HTTP Request არის მოთხოვნა, რომელსაც კლიენტი უგზავნის სერვერს.
// მთავარი მეთოდებია:

// GET – ითხოვს მონაცემს.

// POST – აგზავნის მონაცემს.

// PUT – ანაცვლებს მონაცემს.

// DELETE – შლის მონაცემს.

// PATCH – ნაწილობრივ ცვლის მონაცემს.

// 4) რა არის HTTP Response და Response Codes:
// HTTP Response არის სერვერის პასუხი მოთხოვნაზე.
// მთავარი კოდებია:

// 200 – წარმატება

// 201 – წარმატებით შექმნილია

// 400 – არასწორი მოთხოვნა

// 401 – არაუფლებამოსილია

// 403 – აკრძალულია

// 404 – ვერ მოიძებნა

// 500 – სერვერის შეცდომა

