// eventlistene როგორ სიტყვა გვეუბნება მომხმარებელს ანიჭებს რაიმე event ს, ანუ მაგალითად დაჭერაზე მოხდეს რაიმე ივენტი ან მაუსის მიტანახე მოხდეს რაიმე ივენტი და ასე შემდეგ


// მაგალითი

let h1 = document.getElementById("example")

h1.addEventListener('click', function(){
    h1.textContent = "You clicked!"
})

// ანუ აქ ჩვენ html იდან მივწვდით h1 ს, შემდეგ მაგ h1 ს მივანიჭეთ ივენთი, ივენთს გადაეხემა 2 არგუმენტი, პირველზე რა მოქმედებაზე მოხდეს ესა დუ ის ივენთი ამ შემთხვევაში დაჭერაზე, და მეორე თვითნ ივენთი(ფუნქცია), ამ ივენთში(ფუნცქიაში) უნდა გადავცეთ ის მოქმეედება რომელიც h1 სე დაჭერისას შეასრულებს რაიმე მოქმედებას, ამ შემთხვევააში დაჭერაზე ტექსტი შეიცველბა You clicked! ზე. 